{
  "controls": {
    "showAllModulesCb": "Show All Modules"
  },
  "title": "Education",
  "tabTitle": "Year {{year}}",
  "data": [
    {
      "id": "uos",
      "institution": "University of Sheffield",
      "degreeTitle": "BSc Computer Science",
      "degreeClassification": "2:1 (Class Two Division One Honours)",
      "startDate": "2020.09",
      "endDate": "2023.07",
      "modulesStudied": [
        [
          {
            "code": "fce1001",
            "name": "Global Engineering Challenge Week", 
            "description": "Worked with students from other engineering disciplines, to tackle a real-world problem in an underdeveloped region. The proposal heavily involves the local community in gathering the plastic, which is then fed through a plastic extruder. The recycled plastic can then be used for 3D printing various things, to give back to the locals.",
            "links": [],
            "starred": true
          },
          {
            "code": "com1001",
            "name": "Introduction to Software Engineering", 
            "description": "Involved a group project emulating an agile development process. Developed a student-mentor matching website with Ruby as the backend, using the Sinatra gem. The application is intended for students to learn about the industry they are interested in, which the mentor is a part of. My responsibilities included designing and implementing the backend/database, as well as most of the major functionalities in the system.",
            "links": [],
            "starred": true
          },
          {
            "code": "com1005",
            "name": "Machines and Intelligence", 
            "description": "Went on a deep dive into the history and philosophies of robotics. Then went on to learn various search algorithms like breadth/depth-first search, and the A* Algorithm. Involved in a project implementing the depth and A* algorithms for pathfinding with an abstract overview of a map.",
            "links": ["https://github.com/jwu02/com1005-ramblers-problem"],
            "starred": true
          },
          {
            "code": "com1003",
            "name": "Java Programming", 
            "description": "Built a good understanding of the Object-Oriented Programming paradigm and the Java language.",
            "links": [],
            "starred": true
          },
          {
            "code": "com1002",
            "name": "Foundations of Computer Science", 
            "description": "A discrete maths course on logic and linear algebra.",
            "links": [],
            "starred": false
          },
          {
            "code": "com1006",
            "name": "Devices and Networks", 
            "description": "Involved learning digital logic, computer arithmetic, internet protocols, and data transmission over the internet.",
            "links": [],
            "starred": false
          },
          {
            "code": "com1008",
            "name": "Web and Internet Technology", 
            "description": "(Re)Learned the fundamentals of HTML, CSS, and JavaScript, and built a personal-portfolio website (not this one) as an assignment.",
            "links": [],
            "starred": false
          },
          {
            "code": "com1009",
            "name": "Introduction to Algorithms and Data Structures", 
            "description": "Learned fundamental data structures in Computer Science, as well as algorithm design and complexity analysis.",
            "links": [],
            "starred": false
          }
        ],
        [
          {
            "code": "fce2001",
            "name": "Engineering - You're Hired", 
            "description": "Involved in a cross-disciplinary group project to address a real-world problem, with the theme of IoT. Came up with a proposal plan for developing a physical network of sensors for detecting floods. Also involves developing an application to warn and redirect drivers.",
            "links": [],
            "starred": true
          },
          {
            "code": "com2004",
            "name": "Data Driven Computing", 
            "description": "A machine learning course which involved learning various classification techniques, including both supervised (Naive Bayes, k-nearest neighbor, deep learning) and unsupervised (clustering). Developed a chess piece image classification system implementing both the Naive Bayes and k-nearest neighbour algorithms.",
            "links": ["https://github.com/jwu02/com2004-chess-board-classification"],
            "starred": true
          },
          {
            "code": "com2008",
            "name": "Systems Design and Security", 
            "description": "Involved a group project emulating a real-world agile software development process, with formal requirements analysis and system design process, utilizing UML diagrams. Developed a property booking desktop app following the MVC architecture, with Java as frontend and backend, linking to MySQL database. My responsibilities included all of the above-mentioned things and implementation of the entire system.",
            "links": ["https://github.com/jwu02/com2008-homebreak-plc"],
            "starred": true
          },
          {
            "code": "com2009",
            "name": "Robotics", 
            "description": "Involved a group project programming a small robot dog with Python ROS, in both a simulation and the actual hardware, to complete various tasks such as maze completion, obstacle avoidance, and beaconing (finding and moving towards a target). Ended up completing the entire project by myself, but enjoyed the work involved and took the opportunity to learn a lot.", 
            "links": ["https://github.com/jwu02/com2009-robotics-team-1"],
            "starred": true
          },
          {
            "code": "com3420",
            "name": "Software Hut", 
            "description": "Involved in a group project following an agile development process. Developed an extenuating circumstances system for university staff members, with the Ruby on Rails framework. The system lets students make appeals regarding deadline extensions or poor performances on tests, for example. My responsibilities included designing the entire system with UML diagrams, designing and implementing the database, and implementing most of the major functionalities.", 
            "links": [],
            "starred": true
          },
          {
            "code": "com2107",
            "name": "Logic in Computer Science", 
            "description": "Prove it.",
            "links": [],
            "starred": false
          },
          {
            "code": "com2108",
            "name": "Functional Programming", 
            "description": "Learned the fundamentals of Haskell. Involved an assignment to program and solve a solitaire game with the language.", 
            "links": [],
            "starred": false
          },
          {
            "code": "com2109",
            "name": "Automata, Computation and Complexity", 
            "description": "Algorithms on steroids.",
            "links": [],
            "starred": false
          }
        ],
        [
          {
            "code": "com3610",
            "name": "Dissertation Project", 
            "description": "The title of the dissertation is Exploring Deep Learning for Named Entity Recognition (NER). Developed an NER system from scratch implementing the Multinomial Logistic Regression (MLR) algorithm. Also attempted at developing a Transformer neural network with TensorFlow/Keras (forward inference only).", 
            "links": [],
            "starred": true
          },
          {
            "code": "com3504",
            "name": "The Intelligent Web", 
            "description": "Involved in a group project to develop a bird sighting web application. Made use of the following technologies: Socket.io for real-time client interactions (used to implement a chat functionality), Node.js for the backend, and MongoDB for data storage. Also made use of browser storage and caching technologies to ensure the website also functions offline locally. My responsibilities included the implementation of most of the major functionalities. (Short demo in GitHub repository)", 
            "links": ["https://github.com/jwu02/com3504_bird_watching"],
            "starred": true
          },
          {
            "code": "com3505",
            "name": "The Internet of Things", 
            "description": "An adult LEGO course. Assembled and developed a remote-controlled robot car (via a WAP and served page) using C/C++, on an ESP32 development board (similar to an Arduino). Also installed an ultrasonic sensor for object detection and avoidance whilst the robot is exploring its environment. (Short demo in GitHub repository)", 
            "links": ["https://github.com/jwu02/com3505-robocar"],
            "starred": true
          },
          {
            "code": "com3110",
            "name": "Text Processing",
            "description": "Learned various text processing techniques. Completed two individual assignments: developed a document retrieval system, and a sentiment analysis system using a classifier implementing the Naive Bayes algorithm.", 
            "links": ["https://github.com/jwu02/com3110-information-retrieval-assignment", "https://github.com/jwu02/com3110-sentiment-anaylsis-assignment"],
            "starred": true
          },
          {
            "code": "com3524",
            "name": "Bioinspired Computing", 
            "description": "Learned various modern artificial intelligence techniques and their inspiration from biological systems. Examples include evolution, multicellular tissues, neural systems, the immune system and swarms, inspiring abstractions such as evolutionary or swarm-based optimization algorithms.", 
            "links": [],
            "starred": true
          },
          {
            "code": "com3001",
            "name": "Modelling and Simulation of Natural Systems", 
            "description": "Learning about differential equations with application to the Lotka-Volterra (aka. prey-predator) model. Involved in a group assignment, researching the Lorenz System and simulating it.", 
            "links": [],
            "starred": true
          },
          {
            "code": "com3240",
            "name": "Adaptive Intelligence", 
            "description": "Coded a deep neural network from scratch and modified it for reinforcement learning on a simplified chess game.", 
            "links": ["https://github.com/jwu02/com3240-reinforcement-learning-assignment"],
            "starred": true
          },
          {
            "code": "com3502",
            "name": "Speech Processing", 
            "description": "Touched upon the basics of linguistics, and the biology of human speech and hearing. Also gained some speech processing experience using filters.",
            "links": [],
            "starred": false
          },
          {
            "code": "mgt388",
            "name": "Finance and Law for Engineers", 
            "description": "^",
            "links": [],
            "starred": false
          }
        ]
      ]
    }
  ]
}