{
  "controls": {
    "downloadResumeBtn": "Download CV"
  },
  "header": {
    "interestLabel": "Interested In: ",
    "interests": [
      "Software Engineering",
      "Machine Learning",
      "Robotics Engineering"
    ],
    "selfEvaluation": "I am a proactive and driven individual, committed to continuous learning and skill development. My academic journey has equipped me with strong adaptability, research capabilities, and a passion for acquiring new knowledge. With a background in programming, I possess keen attention to detail and strive for excellence. I am confident that my versatility and skills will allow me to contribute effectively to any team or project, and go further beyond."
  },
  "languages": {
    "title": "Languages",
    "levels": {
      "native": "Native",
      "heritage": "Heritage",
      "intermediate": "Intermediate",
      "beginner": "Beginner"
    },
    "data": {
      "english": "English",
      "mandarin": "Mandarin",
      "taishanese": "Taishanese",
      "cantonese": "Cantonese",
      "japanese": "Japanese",
      "french": "French"
    }
  },
  "skills": {
    "title": "Skills",
    "data": [
      "Proficient with Python, Java and JavaScript, also familiar with TypeScript, PHP and Ruby",
      "Experience with data processing and building machine learning models with Python packages such as Pandas, Numpy, Keras and TensorFlow",
      "Also have experience with building GUIs with PyQt, web scraping with BeautifulSoup, robot programming with Python ROS and ESP32",
      "Experience with frameworks such as Angular, Next/React, Django, RubyOnRails, and Spring Boot",
      "Customer experience working as a waiter and processing orders"
    ]
  },
  "achievements": {
    "title": "Other Activities",
    "data": [
      {
        "year": "2017",
        "details": "Received an award for my continuous effort and willingness to help with producing videos for various events in school. Includes help promoting the work of a charity, aimed towards providing a better educational environment for children in Nepal"
      },
      {
        "year": "2018",
        "details": "Participated in the NCS (National Citizenship Service) program which involved two weeks of volunteering at a care home"
      },
      {
        "year": "2019",
        "details": "Received my UK manual driving license"
      }
    ]
  },
  "education": {
    "title": "Education"
  },
  "workExperience": {
    "title": "Work Experience",
    "data": [
      {
        "role": "Waiter",
        "company": "Let's Sushi",
        "location": "Sheffield",
        "employmentType": "Part-Time",
        "startDate": "2021.11",
        "endDate": "2022.04",
        "responsibilities": []
      },
      {
        "role": "Waiter & Order Processor",
        "company": "Imperial Restaurant",
        "location": "Scunthorpe",
        "employmentType": "Part-Time",
        "startDate": "2018.07",
        "endDate": "2020.01",
        "responsibilities": []
      }
    ]
  },
  "projects": {
    "title": "Project Experience",
    "note": "Work is public on my GitHub profile if interested. You can also find more academic and personal projects there.",
    "data": [
      {
        "name": "LeetInterview", 
        "description": [
          "A personal startup endeavor aimed at creating a platform that facilitates answering common interview questions using both text and speech responses. It includes a tailored administrative dashboard for managing sample questions and study plans.",
          "Utilized Next/React JS and Tailwind CSS to create the front-end interface, incorporating shadcn/ui for customizable UI components.",
          "Engineered a REST API backend using Spring Boot to handle service requests efficiently.",
          "Leveraged the Backblaze B2 storage solution for user response recordings which uses the same SDK for AWS S3."
        ], 
        "links": []
      },
      {
        "name": "Job Applications Tracker",
        "description": [
          "Developed a NextJS application enabling users to manage and track all their job applications in a centralized location.",
          "Utilized Clerk for secure, out-of-the-box authentication and user management, implementing Clerk webhooks to update the MongoDB backend in response to user creation and update events.",
          "Integrated Google Maps API for geolocation services and visualization of job application data."
        ], 
        "links": ["https://github.com/jwu02/job-tracker"]
      },
      {
        "name": "Portfolio Website", 
        "description": [
          "Developed a mobile-responsive personal website using React, Tailwind CSS, and Ant Design UI components.",
          "Implemented site translations in English and Chinese using the i18next package for efficient management and localization."
        ], 
        "links": ["https://github.com/jwu02/jwu02.github.io"]
      },
      {
        "name": "Named Entity Recognition (NER) System",
        "description": [
          "Developed a Multinomial Logistic Regression (MLR) algorithm from scratch as part of my dissertation project.",
          "Utilized NumPy for efficient matrix calculations and Pandas for data sanitization and manipulation during implementation.",
          "Achieved results with the trained and fine-tuned model that closely matched the capabilities of existing systems, demonstrating the effectiveness of the developed algorithm.",
          "Also developed a foundational knowledge of transformer neural networks and attempted at implementing it from scratch."
        ], 
        "links": []
      }
    ]
  },
  "selfEvaluations": {
    "title": "Self Evaluation",
    "data": [
      "I am a proactive individual who is always motivated to learn new things, to self-improve and to expand my skill sets. An important trait to have in this ever-changing, fast-paced field of technology, where there is a constant need to keep up.",
      "I have strong independent learning and research skills and am aware of the various management techniques and workflows, for effective collaboration with other software engineers.",
      "After overcoming the many challenges and struggles of university, I have developed strong perseverance, self-motivation, as well as confidence in my ability to deliver results.",
      "I possess a strong passion for the work I do because, to me, programming is an art that allows me to express my creativity, while also being able to provide value to other people's lives."
    ]
  },
  "hobbies": {
    "title": "Hobbies and Interests",
    "data": [
      "Self Improvement", 
      "Language Learning", 
      "Sports", 
      "Content Creation"
    ]
  }
}